zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70100.PIC
      <edc:SFRDef edc:_addr="0x4000C0D0" edc:access="-----------------------------rrr" edc:cname="TC0_QIMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C0D4" edc:access="-----------------------r-----rrr" edc:cname="TC0_QISR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000C0D8" edc:access="------------------------------nn" edc:cname="TC0_FMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:desc="Enable Compare Fault Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:desc="Enable Compare Fault Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C0DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4000C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TC0_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000C0E8" edc:offset="0x3FD8"/>
      <edc:SFRDef edc:_addr="0x400100C0" edc:access="-------------------------------w" edc:cname="TC1_BCR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchro Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100C4" edc:access="------nnnnnn--nnnnnnnnnn--nnnnnn" edc:cname="TC1_BMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:desc="External Clock Signal 0 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:desc="External Clock Signal 1 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:desc="External Clock Signal 2 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:desc="Quadrature Decoder Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:desc="Position Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:desc="Speed Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:desc="Quadrature Decoding Transparent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:desc="Edge on PHA Count Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:desc="Inverted PHA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:desc="Inverted PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:desc="Inverted Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:desc="Swap PHA and PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:desc="Index Pin is PHB Pin" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:desc="Maximum Filter" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100C8" edc:access="-----------------------------www" edc:cname="TC1_QIER" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100CC" edc:access="-----------------------------www" edc:cname="TC1_QIDR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100D0" edc:access="-----------------------------rrr" edc:cname="TC1_QIMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100D4" edc:access="-----------------------r-----rrr" edc:cname="TC1_QISR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400100D8" edc:access="------------------------------nn" edc:cname="TC1_FMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:desc="Enable Compare Fault Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:desc="Enable Compare Fault Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400100DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400100E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="TC1_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400100E8" edc:offset="0x3FD8"/>
      <edc:SFRDef edc:_addr="0x400140C0" edc:access="-------------------------------w" edc:cname="TC2_BCR" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchro Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140C4" edc:access="------nnnnnn--nnnnnnnnnn--nnnnnn" edc:cname="TC2_BMR" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:desc="External Clock Signal 0 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:desc="External Clock Signal 1 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:desc="External Clock Signal 2 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:desc="Quadrature Decoder Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:desc="Position Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:desc="Speed Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:desc="Quadrature Decoding Transparent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:desc="Edge on PHA Count Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:desc="Inverted PHA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:desc="Inverted PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:desc="Inverted Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:desc="Swap PHA and PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:desc="Index Pin is PHB Pin" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:desc="Maximum Filter" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140C8" edc:access="-----------------------------www" edc:cname="TC2_QIER" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
