zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70100.PIC
      <edc:SFRDef edc:_addr="0x40038234" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038238" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003823C" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038240" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR8" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
