zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70100.PIC
      <edc:SFRDef edc:_addr="0x40044004" edc:access="-----------------nnn-nnn-nnn-nnn" edc:cname="ACC_MR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SELMINUS" edc:desc="Selection for Minus Comparator Input" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TS" edc:desc="Select TS" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="VREFP" edc:desc="Select VREFP" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAC0" edc:desc="Select DAC0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DAC1" edc:desc="Select DAC1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SELPLUS" edc:desc="Selection For Plus Comparator Input" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="AFE0_AD0" edc:desc="Select AFE0_AD0" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD1" edc:desc="Select AFE0_AD1" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD2" edc:desc="Select AFE0_AD2" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD3" edc:desc="Select AFE0_AD3" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD4" edc:desc="Select AFE0_AD4" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AFE0_AD5" edc:desc="Select AFE0_AD5" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD0" edc:desc="Select AFE1_AD0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AFE1_AD1" edc:desc="Select AFE1_AD1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="Analog Comparator Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGETYP" edc:desc="Edge Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Only rising edge of comparator output" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge of comparator output" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ANY" edc:desc="Any edge of comparator output" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INV" edc:desc="Invert Comparator Output" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Analog comparator output is directly processed." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Analog comparator output is inverted prior to being processed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELFS" edc:desc="Selection Of Fault Source" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CE" edc:desc="The CE flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTPUT" edc:desc="The output of the analog comparator flag is used to drive the FAULT output." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FE" edc:desc="Fault Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="The FAULT output is tied to 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="The FAULT output is driven by the signal defined by SELFS." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40044008" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x40044024" edc:access="-------------------------------w" edc:cname="ACC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044028" edc:access="-------------------------------w" edc:cname="ACC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004402C" edc:access="-------------------------------r" edc:cname="ACC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40044030" edc:access="r-----------------------------rr" edc:cname="ACC_ISR" edc:nzwidth="0x20" ltx:memberofperipheral="ACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Comparison Edge (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCO" edc:desc="Synchronized Comparator Output" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Flag Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
