zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70100.PIC
      <edc:AdjustPoint edc:_addr="0x400E10EC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E1100" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTB_SCHMITT" edc:nzwidth="0x20" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E1104" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E1118" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTB_DRIVER" edc:nzwidth="0x20" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LINE0" edc:desc="Drive of PORT Line 0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE1" edc:desc="Drive of PORT Line 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE2" edc:desc="Drive of PORT Line 2" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE3" edc:desc="Drive of PORT Line 3" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE4" edc:desc="Drive of PORT Line 4" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE5" edc:desc="Drive of PORT Line 5" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE6" edc:desc="Drive of PORT Line 6" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE7" edc:desc="Drive of PORT Line 7" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE8" edc:desc="Drive of PORT Line 8" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE9" edc:desc="Drive of PORT Line 9" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE10" edc:desc="Drive of PORT Line 10" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE11" edc:desc="Drive of PORT Line 11" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE12" edc:desc="Drive of PORT Line 12" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE13" edc:desc="Drive of PORT Line 13" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE14" edc:desc="Drive of PORT Line 14" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE15" edc:desc="Drive of PORT Line 15" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE16" edc:desc="Drive of PORT Line 16" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE17" edc:desc="Drive of PORT Line 17" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE18" edc:desc="Drive of PORT Line 18" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE19" edc:desc="Drive of PORT Line 19" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE20" edc:desc="Drive of PORT Line 20" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE21" edc:desc="Drive of PORT Line 21" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE22" edc:desc="Drive of PORT Line 22" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE23" edc:desc="Drive of PORT Line 23" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE24" edc:desc="Drive of PORT Line 24" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE25" edc:desc="Drive of PORT Line 25" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE26" edc:desc="Drive of PORT Line 26" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE27" edc:desc="Drive of PORT Line 27" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE28" edc:desc="Drive of PORT Line 28" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE29" edc:desc="Drive of PORT Line 29" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE30" edc:desc="Drive of PORT Line 30" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE31" edc:desc="Drive of PORT Line 31" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
