zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/edc/PIC32CZ1038CA70100.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27"/>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D7" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28"/>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMC1_PWMFI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30"/>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="I2SC0_DO" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31"/>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SPI0_NPCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD10" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC1_AD0" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CANTX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CTS0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SPI0_NPCS0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CANRX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RTS0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD2" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBCLK" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBDAT" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="TRACESWO" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="SWDIO" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="SWDCLK" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8"/>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9"/>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12"/>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="ERASE" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13"/>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXEN" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI1_NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXDV" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWML2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DSR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8"/>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMFI1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACECLK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9"/>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AFEC1_ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10"/>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MLBSIG" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11"/>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12"/>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPI0_NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13"/>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCOL" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14"/>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXCK" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15"/>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16"/>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TXD2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17"/>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SCK2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18"/>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19"/>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20"/>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_MISO" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21"/>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_MOSI" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22"/>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWMH2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_SPCK" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24"/>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_HSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25"/>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_NPCS1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_VSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26"/>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD27"/>
      <edc:VirtualPin edc:name="PD27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMC0_PWML3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPI0_NPCS3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TWD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D8" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD28"/>
      <edc:VirtualPin edc:name="PD28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TWCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D9" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD30"/>
      <edc:VirtualPin edc:name="PD30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="ISI_D10" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AFEC0_AD0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31"/>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="ISI_D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMII"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDUTMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>